micropython/micropython/ports/stm32/rtc.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/runtime.h"
#include "shared/timeutils/timeutils.h"
#include "extint.h"
#include "rtc.h"
#include "irq.h"

#if defined(STM32WB)
#define RCC_CSR_LSION RCC_CSR_LSI1ON
#define RCC_FLAG_LSIRDY RCC_FLAG_LSI1RDY
#define RCC_OSCILLATORTYPE_LSI RCC_OSCILLATORTYPE_LSI1
#define __HAL_RCC_LSI_ENABLE __HAL_RCC_LSI1_ENABLE
#define __HAL_RCC_LSI_DISABLE __HAL_RCC_LSI1_DISABLE
#endif

/// \moduleref pyb
/// \class RTC - real time clock
///
/// The RTC is an independent clock that keeps track of the date
/// and time.
///
/// Example usage:
///
///     rtc = pyb.RTC()
///     rtc.datetime((2014, 5, 1, 4, 13, 0, 0, 0))
///     print(rtc.datetime())

RTC_HandleTypeDef RTCHandle;

// rtc_info indicates various things about RTC startup
// it's a bit of a hack at the moment
static mp_uint_t rtc_info;

// Note: LSI is around (32KHz), these dividers should work either way
// ck_spre(1Hz) = RTCCLK(LSE) /(uwAsynchPrediv + 1)*(uwSynchPrediv + 1)
// modify RTC_ASYNCH_PREDIV & RTC_SYNCH_PREDIV in board/<BN>/mpconfigport.h to change sub-second ticks
// default is 3906.25 us, min is ~30.52 us (will increase Ivbat by ~500nA)
#ifndef RTC_ASYNCH_PREDIV
#define RTC_ASYNCH_PREDIV (0x7f)
#endif
#ifndef RTC_SYNCH_PREDIV
#define RTC_SYNCH_PREDIV  (0x00ff)
#endif

// The prescalers are selected at startup for the clock source the RTC actually
// runs from: the plain RTC_x_PREDIV values above divide a 32768Hz LSE, and the
// _LSI values the LSI, dividing by its nominal 32000 by default.
#ifndef RTC_ASYNCH_PREDIV_LSE
#define RTC_ASYNCH_PREDIV_LSE RTC_ASYNCH_PREDIV
#endif
#ifndef RTC_SYNCH_PREDIV_LSE
#define RTC_SYNCH_PREDIV_LSE RTC_SYNCH_PREDIV
#endif
#ifndef RTC_ASYNCH_PREDIV_LSI
#define RTC_ASYNCH_PREDIV_LSI (0x7f)
#endif
#ifndef RTC_SYNCH_PREDIV_LSI
#define RTC_SYNCH_PREDIV_LSI  (249)
#endif

static HAL_StatusTypeDef PYB_RTC_Init(RTC_HandleTypeDef *hrtc);
static void PYB_RTC_MspInit_Kick(RTC_HandleTypeDef *hrtc, bool rtc_use_lse, bool rtc_use_byp);
static HAL_StatusTypeDef PYB_RTC_MspInit_Finalise(RTC_HandleTypeDef *hrtc);
static void RTC_CalendarConfig(void);

#if MICROPY_HW_RTC_USE_LSE || MICROPY_HW_RTC_USE_BYPASS
static bool rtc_use_lse = true;
#else
static bool rtc_use_lse = false;
#endif
static uint32_t rtc_startup_tick;
static bool rtc_need_init_finalise = false;

#if defined(STM32L0)
#define BDCR CSR
#define RCC_BDCR_RTCEN RCC_CSR_RTCEN
#define RCC_BDCR_RTCSEL RCC_CSR_RTCSEL
#define RCC_BDCR_RTCSEL_0 RCC_CSR_RTCSEL_0
#define RCC_BDCR_RTCSEL_1 RCC_CSR_RTCSEL_1
#define RCC_BDCR_LSEON RCC_CSR_LSEON
#define RCC_BDCR_LSERDY RCC_CSR_LSERDY
#define RCC_BDCR_LSEBYP RCC_CSR_LSEBYP
#elif defined(STM32L1)
#define BDCR CR
#define RCC_BDCR_RTCEN RCC_CSR_RTCEN
#define RCC_BDCR_RTCSEL RCC_CSR_RTCSEL
#define RCC_BDCR_RTCSEL_0 RCC_CSR_RTCSEL_0
#define RCC_BDCR_RTCSEL_1 RCC_CSR_RTCSEL_1
#define RCC_BDCR_LSEON RCC_CSR_LSEON
#define RCC_BDCR_LSERDY RCC_CSR_LSERDY
#define RCC_BDCR_LSEBYP RCC_CSR_LSEBYP
#endif

#if defined(STM32N6)
#define RCC_DBP_TIMEOUT_VALUE (5)
#endif

void rtc_init_start(bool force_init) {
    // Enable the RTC APB bus clock, to communicate with the RTC.
    #if defined(STM32H5)
    __HAL_RCC_RTC_CLK_ENABLE();
    #elif defined(STM32G0) || defined(STM32U5) || defined(STM32WL)
    __HAL_RCC_RTCAPB_CLK_ENABLE();
    #endif

    RTCHandle.Instance = RTC;

    /* Configure RTC prescaler and RTC data registers */
    /* RTC configured as follow:
      - Hour Format    = Format 24
      - Asynch Prediv  = Value according to source clock
      - Synch Prediv   = Value according to source clock
      - OutPut         = Output Disable
      - OutPutPolarity = High Polarity
      - OutPutType     = Open Drain */
    RTCHandle.Init.HourFormat = RTC_HOURFORMAT_24;
    if (rtc_use_lse) {
        RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSE;
        RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSE;
    } else {
        RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSI;
        RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSI;
    }
    RTCHandle.Init.OutPut = RTC_OUTPUT_DISABLE;
    RTCHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
    RTCHandle.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;

    rtc_need_init_finalise = false;

    if (!force_init) {
        bool rtc_running = false;
        #if defined(STM32N6)
        // Note: the low-level boot on the N6 seems to always enable the RTC and the LSI, and
        // switch the RTC to LSI mode.  So the logic below needs to account for that:
        // - if LSE is ready then switch back to the LSE
        // - even if LSI is ready, don't use it if the board is configured to use LSE
        uint32_t rtc_clock_source = LL_RCC_GetRTCClockSource();
        if (LL_RCC_IsEnabledRTC()
            && LL_RCC_LSE_IsReady()) {
            // LSE is enabled & ready --> no need to (re-)init RTC
            rtc_running = true;
            RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSE;
            RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSE;
            if (rtc_clock_source != LL_RCC_RTC_CLKSOURCE_LSE) {
                LL_RCC_SetRTCClockSource(LL_RCC_RTC_CLKSOURCE_LSE);
            }
            // remove Backup Domain write protection
            HAL_PWR_EnableBkUpAccess();
            // Clear source Reset Flag
            __HAL_RCC_CLEAR_RESET_FLAGS();
            // provide some status information
            rtc_info |= 0x40000;
        } else if (!rtc_use_lse
                   && LL_RCC_IsEnabledRTC()
                   && rtc_clock_source == LL_RCC_RTC_CLKSOURCE_LSI) {
            // LSI configured as the RTC clock source --> no need to (re-)init RTC
            rtc_running = true;
            RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSI;
            RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSI;
            // remove Backup Domain write protection
            HAL_PWR_EnableBkUpAccess();
            // Clear source Reset Flag
            __HAL_RCC_CLEAR_RESET_FLAGS();
            // Turn the LSI on (it may need this even if the RTC is running)
            LL_RCC_LSI_Enable();
            // provide some status information
            rtc_info |= 0x80000;
        }
        #else
        uint32_t bdcr = RCC->BDCR;
        if ((bdcr & (RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL | RCC_BDCR_LSEON | RCC_BDCR_LSERDY))
            == (RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_0 | RCC_BDCR_LSEON | RCC_BDCR_LSERDY)) {
            // LSE is enabled & ready --> no need to (re-)init RTC
            rtc_running = true;
            RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSE;
            RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSE;
            // remove Backup Domain write protection
            HAL_PWR_EnableBkUpAccess();
            // Clear source Reset Flag
            __HAL_RCC_CLEAR_RESET_FLAGS();
            // provide some status information
            rtc_info |= 0x40000;
        } else if ((bdcr & (RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL))
                   == (RCC_BDCR_RTCEN | RCC_BDCR_RTCSEL_1)) {
            // LSI configured as the RTC clock source --> no need to (re-)init RTC
            rtc_running = true;
            RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSI;
            RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSI;
            // remove Backup Domain write protection
            HAL_PWR_EnableBkUpAccess();
            // Clear source Reset Flag
            __HAL_RCC_CLEAR_RESET_FLAGS();
            // Turn the LSI on (it may need this even if the RTC is running)
            #if defined(STM32H5) || defined(STM32U5)
            RCC->BDCR |= RCC_BDCR_LSION;
            #else
            RCC->CSR |= RCC_CSR_LSION;
            #endif
            // provide some status information
            rtc_info |= 0x80000;
        }
        #endif

        if (rtc_running) {
            // Provide information about the registers that indicated the RTC is running.
            // Bits are (MSB first): LSIRDY LSION LSEBYP LSERDY LSEON
            #if defined(STM32H5) || defined(STM32U5)
            rtc_info |= (RCC->BDCR >> RCC_BDCR_LSEON_Pos & 7) | (RCC->BDCR >> RCC_BDCR_LSION_Pos & 3) << 8;
            #else
            rtc_info |= (RCC->BDCR & 7) | (RCC->CSR & 3) << 8;
            #endif

            // Check that the sync and async prescaler values are correct.  If the RTC
            // gets into a state where they are wrong then it will run slow or fast and
            // never be corrected.  In such a situation, attempt to reconfigure the values
            // without changing the data/time.
            if (LL_RTC_GetSynchPrescaler(RTC) != RTCHandle.Init.SynchPrediv
                || LL_RTC_GetAsynchPrescaler(RTC) != RTCHandle.Init.AsynchPrediv) {
                // Values are wrong, attempt to enter RTC init mode and change them.
                LL_RTC_DisableWriteProtection(RTC);
                LL_RTC_EnableInitMode(RTC);
                uint32_t ticks_ms = HAL_GetTick();
                while (HAL_GetTick() - ticks_ms < RTC_TIMEOUT_VALUE) {
                    if (LL_RTC_IsActiveFlag_INIT(RTC)) {
                        // Reconfigure the RTC prescaler register PRER.
                        LL_RTC_SetSynchPrescaler(RTC, RTCHandle.Init.SynchPrediv);
                        LL_RTC_SetAsynchPrescaler(RTC, RTCHandle.Init.AsynchPrediv);
                        LL_RTC_DisableInitMode(RTC);
                        break;
                    }
                }
                LL_RTC_EnableWriteProtection(RTC);

                // Provide information that the prescaler was changed.
                rtc_info |= 0x100000;
            }

            // The RTC is up and running, so return without any further configuration.
            return;
        }
    }

    rtc_startup_tick = HAL_GetTick();
    rtc_info = 0x3f000000 | (rtc_startup_tick & 0xffffff);
    PYB_RTC_MspInit_Kick(&RTCHandle, rtc_use_lse, MICROPY_HW_RTC_USE_BYPASS);
}

void rtc_init_finalise() {
    if (!rtc_need_init_finalise) {
        return;
    }

    rtc_info = 0;
    while (PYB_RTC_Init(&RTCHandle) != HAL_OK) {
        if (rtc_use_lse) {
            #if MICROPY_HW_RTC_USE_BYPASS
            if (RCC->BDCR & RCC_BDCR_LSEBYP) {
                // LSEBYP failed, fallback to LSE non-bypass
                rtc_info |= 0x02000000;
            } else
            #endif
            {
                // LSE failed, fallback to LSI
                rtc_use_lse = false;
                rtc_info |= 0x01000000;
                RTCHandle.Init.AsynchPrediv = RTC_ASYNCH_PREDIV_LSI;
                RTCHandle.Init.SynchPrediv = RTC_SYNCH_PREDIV_LSI;
            }
            rtc_startup_tick = HAL_GetTick();
            PYB_RTC_MspInit_Kick(&RTCHandle, rtc_use_lse, false);
            HAL_PWR_EnableBkUpAccess();
            RTCHandle.State = HAL_RTC_STATE_RESET;
        } else {
            // init error
            rtc_info |= 0xffff; // indicate error
            return;
        }
    }

    // RTC started successfully
    rtc_info = 0x20000000;

